testCase circular/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    inletA
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.03;
        value           uniform 0.1;
    }   
    inletB
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.03;
        value           uniform 0.1;
    }   
    outlet
    {
         type            zeroGradient;
    }
    walls
    {
        type            epsilonWallFunction;
        lowReCorrection true;
        value           uniform 0.1;
    }
}

// ************************************************************************* //
