testCase circular/system/fieldAverage
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates and writes the time averages of given list of fields.

\*---------------------------------------------------------------------------*/

type                fieldAverage;
functionObjectLibs  ("libfieldFunctionObjects.so");

timeStart           1;
writeControl        writeTime;
//writeInterval       0.01;


mean            yes;
prime2Mean      no;

fields          (NaOH);

// ************************************************************************* //
